Revit 2026 API

# DockablePaneState(DockablePaneState) Constructor

---

Constructs a new copy of the input DockablePaneState object.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public DockablePaneState(
	DockablePaneState other
)
```
```vb
Public Sub New (
	other As DockablePaneState
)
```
```cpp
public:
DockablePaneState(
	DockablePaneState^ other
)
```
```fsharp
new :
        other : DockablePaneState -> DockablePaneState
```

#### Parameters

other DockablePaneState

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

DockablePaneState Class

DockablePaneState Overload

Autodesk.Revit.UI Namespace